; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-8-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p0-5 - location
	p1-0 - location
	p1-2 - location
	p1-4 - location
	p2-3 - location
	p3-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s3)
	(at truck1 s5)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s5)
	(empty truck6)
	(at truck7 s2)
	(empty truck7)
	(at truck8 s3)
	(empty truck8)
	(at package1 s2)
	(at package2 s0)
	(at package3 s4)
	(at package4 s0)
	(at package5 s3)
	(at package6 s0)
	(at package7 s4)
	(at package8 s5)
	(at package9 s5)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 86)
	(= (time-to-walk p0-1 s0) 86)
	(= (time-to-walk s1 p0-1) 60)
	(= (time-to-walk p0-1 s1) 60)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 75)
	(= (time-to-walk p0-5 s0) 75)
	(= (time-to-walk s5 p0-5) 68)
	(= (time-to-walk p0-5 s5) 68)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 99)
	(= (time-to-walk p1-2 s1) 99)
	(= (time-to-walk s2 p1-2) 98)
	(= (time-to-walk p1-2 s2) 98)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 26)
	(= (time-to-walk p1-4 s1) 26)
	(= (time-to-walk s4 p1-4) 5)
	(= (time-to-walk p1-4 s4) 5)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 73)
	(= (time-to-walk p2-3 s2) 73)
	(= (time-to-walk s3 p2-3) 92)
	(= (time-to-walk p2-3 s3) 92)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 83)
	(= (time-to-walk p3-1 s3) 83)
	(= (time-to-walk s1 p3-1) 43)
	(= (time-to-walk p3-1 s1) 43)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 7)
	(= (time-to-drive s2 s0) 7)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 94)
	(= (time-to-drive s3 s0) 94)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 65)
	(= (time-to-drive s5 s0) 65)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 95)
	(= (time-to-drive s0 s1) 95)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 53)
	(= (time-to-drive s2 s1) 53)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 49)
	(= (time-to-drive s4 s1) 49)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 5)
	(= (time-to-drive s1 s3) 5)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 66)
	(= (time-to-drive s2 s3) 66)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 80)
	(= (time-to-drive s5 s3) 80)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 60)
	(= (time-to-drive s1 s5) 60)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s5)
	(at driver2 s4)
	(at driver3 s0)
	(at truck1 s2)
	(at truck2 s4)
	(at truck3 s1)
	(at truck4 s2)
	(at truck6 s0)
	(at truck7 s2)
	(at truck8 s4)
	(at package1 s1)
	(at package2 s4)
	(at package3 s4)
	(at package4 s1)
	(at package5 s5)
	(at package6 s1)
	(at package7 s4)
	(at package8 s3)
	(at package9 s0)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 3  (driven))) (* 1  (walked))))

)

; plan
1. (board-truck driver3 truck8 s3)
   deleted: (at driver3 s3) (empty truck8)
   added: (driving driver3 truck8)
   goals met: 4 of 19
2. (drive-truck truck8 s3 s2 driver3)
   deleted: (at truck8 s3)
   added: (at truck8 s2)
   changed: (driven) from 0 to 66
   goals met: 4 of 19
3. (load-truck package1 truck8 s2)
   deleted: (at package1 s2)
   added: (in package1 truck8)
   goals met: 4 of 19
4. (drive-truck truck8 s2 s3 driver3)
   deleted: (at truck8 s2)
   added: (at truck8 s3)
   changed: (driven) from 66 to 132
   goals met: 4 of 19
5. (load-truck package5 truck8 s3)
   deleted: (at package5 s3)
   added: (in package5 truck8)
   goals met: 4 of 19
6. (drive-truck truck8 s3 s5 driver3)
   deleted: (at truck8 s3)
   added: (at truck8 s5)
   changed: (driven) from 132 to 212
   goals met: 4 of 19
7. (load-truck package8 truck8 s5)
   deleted: (at package8 s5)
   added: (in package8 truck8)
   goals met: 4 of 19
8. (walk driver2 s2 p2-3)
   deleted: (at driver2 s2)
   added: (at driver2 p2-3)
   changed: (walked) from 0 to 73
   goals met: 4 of 19
9. (walk driver2 p2-3 s3)
   deleted: (at driver2 p2-3)
   added: (at driver2 s3)
   changed: (walked) from 73 to 165
   goals met: 4 of 19
10. (unload-truck package5 truck8 s5)
   deleted: (in package5 truck8)
   added: (at package5 s5)
   goals met: 5 of 19
11. (drive-truck truck8 s5 s0 driver3)
   deleted: (at truck8 s5)
   added: (at truck8 s0)
   changed: (driven) from 212 to 277
   goals met: 5 of 19
12. (load-truck package2 truck8 s0)
   deleted: (at package2 s0)
   added: (in package2 truck8)
   goals met: 5 of 19
13. (load-truck package4 truck8 s0)
   deleted: (at package4 s0)
   added: (in package4 truck8)
   goals met: 5 of 19
14. (drive-truck truck8 s0 s5 driver3)
   deleted: (at truck8 s0)
   added: (at truck8 s5)
   changed: (driven) from 277 to 342
   goals met: 5 of 19
15. (walk driver1 s2 p1-2)
   deleted: (at driver1 s2)
   added: (at driver1 p1-2)
   changed: (walked) from 165 to 263
   goals met: 5 of 19
16. (load-truck package9 truck8 s5)
   deleted: (at package9 s5)
   added: (in package9 truck8)
   goals met: 5 of 19
17. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   changed: (walked) from 263 to 362
   goals met: 5 of 19
18. (drive-truck truck8 s5 s0 driver3)
   deleted: (at truck8 s5)
   added: (at truck8 s0)
   changed: (driven) from 342 to 407
   goals met: 5 of 19
19. (unload-truck package9 truck8 s0)
   deleted: (in package9 truck8)
   added: (at package9 s0)
   goals met: 6 of 19
20. (load-truck package6 truck8 s0)
   deleted: (at package6 s0)
   added: (in package6 truck8)
   goals met: 6 of 19
21. (drive-truck truck8 s0 s1 driver3)
   deleted: (at truck8 s0)
   added: (at truck8 s1)
   changed: (driven) from 407 to 502
   goals met: 6 of 19
22. (unload-truck package1 truck8 s1)
   deleted: (in package1 truck8)
   added: (at package1 s1)
   goals met: 7 of 19
23. (unload-truck package6 truck8 s1)
   deleted: (in package6 truck8)
   added: (at package6 s1)
   goals met: 8 of 19
24. (drive-truck truck8 s1 s0 driver3)
   deleted: (at truck8 s1)
   added: (at truck8 s0)
   changed: (driven) from 502 to 597
   goals met: 8 of 19
25. (board-truck driver2 truck2 s3)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 8 of 19
26. (drive-truck truck2 s3 s1 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (driven) from 597 to 602
   goals met: 8 of 19
27. (drive-truck truck8 s0 s3 driver3)
   deleted: (at truck8 s0)
   added: (at truck8 s3)
   changed: (driven) from 602 to 696
   goals met: 8 of 19
28. (unload-truck package8 truck8 s3)
   deleted: (in package8 truck8)
   added: (at package8 s3)
   goals met: 9 of 19
29. (drive-truck truck2 s1 s4 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 696 to 745
   goals met: 10 of 19
30. (disembark-truck driver2 truck2 s4)
   deleted: (driving driver2 truck2)
   added: (at driver2 s4) (empty truck2)
   goals met: 11 of 19
31. (drive-truck truck8 s3 s5 driver3)
   deleted: (at truck8 s3)
   added: (at truck8 s5)
   changed: (driven) from 745 to 825
   goals met: 11 of 19
32. (walk driver1 s1 p3-1)
   deleted: (at driver1 s1)
   added: (at driver1 p3-1)
   changed: (walked) from 362 to 405
   goals met: 11 of 19
33. (walk driver1 p3-1 s3)
   deleted: (at driver1 p3-1)
   added: (at driver1 s3)
   changed: (walked) from 405 to 488
   goals met: 11 of 19
34. (drive-truck truck8 s5 s1 driver3)
   deleted: (at truck8 s5)
   added: (at truck8 s1)
   changed: (driven) from 825 to 885
   goals met: 11 of 19
35. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 11 of 19
36. (drive-truck truck3 s3 s5 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (driven) from 885 to 965
   goals met: 11 of 19
37. (disembark-truck driver1 truck3 s5)
   deleted: (driving driver1 truck3)
   added: (at driver1 s5) (empty truck3)
   goals met: 12 of 19
38. (unload-truck package4 truck8 s1)
   deleted: (in package4 truck8)
   added: (at package4 s1)
   goals met: 13 of 19
39. (drive-truck truck8 s1 s4 driver3)
   deleted: (at truck8 s1)
   added: (at truck8 s4)
   changed: (driven) from 965 to 1014
   goals met: 14 of 19
40. (unload-truck package2 truck8 s4)
   deleted: (in package2 truck8)
   added: (at package2 s4)
   goals met: 15 of 19
41. (board-truck driver1 truck1 s5)
   deleted: (at driver1 s5) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 14 of 19
42. (drive-truck truck1 s5 s3 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (driven) from 1014 to 1094
   goals met: 14 of 19
43. (drive-truck truck8 s4 s1 driver3)
   deleted: (at truck8 s4)
   added: (at truck8 s1)
   changed: (driven) from 1094 to 1143
   goals met: 13 of 19
44. (drive-truck truck1 s3 s2 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   changed: (driven) from 1143 to 1209
   goals met: 14 of 19
45. (drive-truck truck8 s1 s5 driver3)
   deleted: (at truck8 s1)
   added: (at truck8 s5)
   changed: (driven) from 1209 to 1269
   goals met: 14 of 19
46. (disembark-truck driver3 truck8 s5)
   deleted: (driving driver3 truck8)
   added: (at driver3 s5) (empty truck8)
   goals met: 14 of 19
47. (board-truck driver3 truck6 s5)
   deleted: (at driver3 s5) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 14 of 19
48. (drive-truck truck6 s5 s0 driver3)
   deleted: (at truck6 s5)
   added: (at truck6 s0)
   changed: (driven) from 1269 to 1334
   goals met: 15 of 19
49. (disembark-truck driver3 truck6 s0)
   deleted: (driving driver3 truck6)
   added: (at driver3 s0) (empty truck6)
   goals met: 16 of 19
50. (drive-truck truck1 s2 s1 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 1334 to 1387
   goals met: 15 of 19
51. (walk driver3 s0 p0-5)
   deleted: (at driver3 s0)
   added: (at driver3 p0-5)
   changed: (walked) from 488 to 563
   goals met: 14 of 19
52. (walk driver3 p0-5 s5)
   deleted: (at driver3 p0-5)
   added: (at driver3 s5)
   changed: (walked) from 563 to 631
   goals met: 14 of 19
53. (board-truck driver3 truck8 s5)
   deleted: (at driver3 s5) (empty truck8)
   added: (driving driver3 truck8)
   goals met: 14 of 19
54. (drive-truck truck8 s5 s1 driver3)
   deleted: (at truck8 s5)
   added: (at truck8 s1)
   changed: (driven) from 1387 to 1447
   goals met: 14 of 19
55. (drive-truck truck8 s1 s4 driver3)
   deleted: (at truck8 s1)
   added: (at truck8 s4)
   changed: (driven) from 1447 to 1496
   goals met: 15 of 19
56. (disembark-truck driver3 truck8 s4)
   deleted: (driving driver3 truck8)
   added: (at driver3 s4) (empty truck8)
   goals met: 15 of 19
57. (drive-truck truck1 s1 s5 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 1496 to 1556
   goals met: 15 of 19
58. (walk driver3 s4 p1-4)
   deleted: (at driver3 s4)
   added: (at driver3 p1-4)
   changed: (walked) from 631 to 636
   goals met: 15 of 19
59. (walk driver3 p1-4 s1)
   deleted: (at driver3 p1-4)
   added: (at driver3 s1)
   changed: (walked) from 636 to 662
   goals met: 15 of 19
60. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   changed: (walked) from 662 to 722
   goals met: 15 of 19
61. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   changed: (walked) from 722 to 808
   goals met: 16 of 19
62. (drive-truck truck1 s5 s0 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (driven) from 1556 to 1621
   goals met: 16 of 19
63. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 1621 to 1628
   goals met: 17 of 19
64. (walk driver3 s0 p0-5)
   deleted: (at driver3 s0)
   added: (at driver3 p0-5)
   changed: (walked) from 808 to 883
   goals met: 16 of 19
65. (walk driver3 p0-5 s5)
   deleted: (at driver3 p0-5)
   added: (at driver3 s5)
   changed: (walked) from 883 to 951
   goals met: 16 of 19
66. (board-truck driver3 truck3 s5)
   deleted: (at driver3 s5) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 16 of 19
67. (drive-truck truck3 s5 s1 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (driven) from 1628 to 1688
   goals met: 17 of 19
68. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 17 of 19
69. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 17 of 19
70. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   changed: (walked) from 951 to 1011
   goals met: 17 of 19
71. (walk driver1 s2 p1-2)
   deleted: (at driver1 s2)
   added: (at driver1 p1-2)
   changed: (walked) from 1011 to 1109
   goals met: 17 of 19
72. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 16 of 19
73. (drive-truck truck2 s4 s1 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (driven) from 1688 to 1737
   goals met: 15 of 19
74. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 15 of 19
75. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   changed: (walked) from 1109 to 1208
   goals met: 15 of 19
76. (walk driver2 s1 p1-4)
   deleted: (at driver2 s1)
   added: (at driver2 p1-4)
   changed: (walked) from 1208 to 1234
   goals met: 15 of 19
77. (board-truck driver1 truck3 s1)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 15 of 19
78. (drive-truck truck3 s1 s5 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (driven) from 1737 to 1797
   goals met: 14 of 19
79. (walk driver3 p0-1 s1)
   deleted: (at driver3 p0-1)
   added: (at driver3 s1)
   changed: (walked) from 1234 to 1294
   goals met: 14 of 19
80. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 14 of 19
81. (drive-truck truck2 s1 s4 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 1797 to 1846
   goals met: 15 of 19
82. (drive-truck truck3 s5 s1 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (driven) from 1846 to 1906
   goals met: 16 of 19
83. (disembark-truck driver3 truck2 s4)
   deleted: (driving driver3 truck2)
   added: (at driver3 s4) (empty truck2)
   goals met: 16 of 19
84. (drive-truck truck3 s1 s5 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (driven) from 1906 to 1966
   goals met: 15 of 19
85. (walk driver3 s4 p1-4)
   deleted: (at driver3 s4)
   added: (at driver3 p1-4)
   changed: (walked) from 1294 to 1299
   goals met: 15 of 19
86. (drive-truck truck3 s5 s1 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (driven) from 1966 to 2026
   goals met: 16 of 19
87. (disembark-truck driver1 truck3 s1)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 16 of 19
88. (walk driver3 p1-4 s1)
   deleted: (at driver3 p1-4)
   added: (at driver3 s1)
   changed: (walked) from 1299 to 1325
   goals met: 16 of 19
89. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 16 of 19
90. (walk driver2 p1-4 s4)
   deleted: (at driver2 p1-4)
   added: (at driver2 s4)
   changed: (walked) from 1325 to 1330
   goals met: 17 of 19
91. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 2026 to 2121
   goals met: 16 of 19
92. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 17 of 19
93. (walk driver1 s1 p1-4)
   deleted: (at driver1 s1)
   added: (at driver1 p1-4)
   changed: (walked) from 1330 to 1356
   goals met: 17 of 19
94. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 16 of 19
95. (drive-truck truck3 s0 s1 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 2121 to 2216
   goals met: 17 of 19
96. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 17 of 19
97. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   changed: (walked) from 1356 to 1416
   goals met: 17 of 19
98. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 16 of 19
99. (drive-truck truck2 s4 s1 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (driven) from 2216 to 2265
   goals met: 15 of 19
100. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 15 of 19
101. (walk driver2 s1 p1-4)
   deleted: (at driver2 s1)
   added: (at driver2 p1-4)
   changed: (walked) from 1416 to 1442
   goals met: 15 of 19
102. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   changed: (walked) from 1442 to 1528
   goals met: 16 of 19
103. (board-truck driver3 truck6 s0)
   deleted: (at driver3 s0) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 15 of 19
104. (walk driver2 p1-4 s4)
   deleted: (at driver2 p1-4)
   added: (at driver2 s4)
   changed: (walked) from 1528 to 1533
   goals met: 16 of 19
105. (drive-truck truck6 s0 s1 driver3)
   deleted: (at truck6 s0)
   added: (at truck6 s1)
   changed: (driven) from 2265 to 2360
   goals met: 15 of 19
106. (walk driver1 p1-4 s1)
   deleted: (at driver1 p1-4)
   added: (at driver1 s1)
   changed: (walked) from 1533 to 1559
   goals met: 15 of 19
107. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 15 of 19
108. (drive-truck truck2 s1 s4 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 2360 to 2409
   goals met: 16 of 19
109. (disembark-truck driver3 truck6 s1)
   deleted: (driving driver3 truck6)
   added: (at driver3 s1) (empty truck6)
   goals met: 16 of 19
110. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   changed: (walked) from 1559 to 1619
   goals met: 16 of 19
111. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   changed: (walked) from 1619 to 1705
   goals met: 17 of 19
112. (walk driver2 s4 p1-4)
   deleted: (at driver2 s4)
   added: (at driver2 p1-4)
   changed: (walked) from 1705 to 1710
   goals met: 16 of 19
113. (drive-truck truck2 s4 s1 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (driven) from 2409 to 2458
   goals met: 15 of 19
114. (walk driver2 p1-4 s1)
   deleted: (at driver2 p1-4)
   added: (at driver2 s1)
   changed: (walked) from 1710 to 1736
   goals met: 15 of 19
115. (board-truck driver2 truck6 s1)
   deleted: (at driver2 s1) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 15 of 19
116. (drive-truck truck6 s1 s0 driver2)
   deleted: (at truck6 s1)
   added: (at truck6 s0)
   changed: (driven) from 2458 to 2553
   goals met: 16 of 19
117. (drive-truck truck2 s1 s5 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (driven) from 2553 to 2613
   goals met: 16 of 19
118. (disembark-truck driver2 truck6 s0)
   deleted: (driving driver2 truck6)
   added: (at driver2 s0) (empty truck6)
   goals met: 16 of 19
119. (drive-truck truck2 s5 s0 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   changed: (driven) from 2613 to 2678
   goals met: 16 of 19
120. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 16 of 19
121. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 16 of 19
122. (walk driver1 s0 p0-5)
   deleted: (at driver1 s0)
   added: (at driver1 p0-5)
   changed: (walked) from 1736 to 1811
   goals met: 16 of 19
123. (walk driver1 p0-5 s5)
   deleted: (at driver1 p0-5)
   added: (at driver1 s5)
   changed: (walked) from 1811 to 1879
   goals met: 17 of 19
124. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 2678 to 2773
   goals met: 17 of 19
125. (drive-truck truck2 s1 s4 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 2773 to 2822
   goals met: 18 of 19
126. (disembark-truck driver2 truck2 s4)
   deleted: (driving driver2 truck2)
   added: (at driver2 s4) (empty truck2)
   goals met: 19 of 19
